Repository: GamemakerChina/GMS2_manual_en2ch
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: "Exit" simply ends the execution of the current script or event.
zh_cn: “Exit”简单的结束当前脚本或事件的运行。

source: "break" in a for loop:
zh_cn: for 循环中的“break”：

source: "break" in a repeat loop:
zh_cn: repeat 循环中的“break”：

source: "break" in a while loop:
zh_cn: while循环中的“break”：

source: "break" when using with:
zh_cn: with中的“break”：

source: $\n$\nClick 'OK' to remove the previous version or 'Cancel' to cancel this upgrade.
zh_cn: $\n$\n单击“确定”删除以前的版本，或单击“取消”取消此升级。

source: ${APP_NAME} is already installed.
zh_cn: ${APP_NAME} 已经安装完成。

source: ${EXEFILENAME} is running.
zh_cn: ${EXEFILENAME} 正在运行。

source: ${ctrl}+MMB to open the inherited event instead of the manual.
zh_cn: ${ctrl}+MMB 打开继续事件，以代替手动。

source: % of Native DPI
zh_cn: % 的本地分辨率（DPI）

source: % of native DPI
zh_cn: % 的本地分辨率（DPI）

source: % when application is not in focus
zh_cn: % 在应用失去焦点时

source: % when on AC Power
zh_cn: % 在使用交流电源时

source: % when on Battery Power
zh_cn: % 在使用电池电源时

source: %appdata%\<Game Name>
zh_cn: %appdata%\<游戏名称>

source: %localappdata%\<Game Name>
zh_cn: %localappdata%\<游戏名称>

source: 'My Projects' directory
zh_cn: “我的项目”目录

source: 'My Projects' location
zh_cn: “我的项目（My Projects）”位置

source: '{0}' cannot be used as a name for the Remote Worker.
zh_cn: '{0}' 不能用作远程工作者（Remote Worker）的名字。

source: '{0}' contains invalid characters, should only contain 0-9, a-z, A-Z, _ or .
zh_cn: '{0}' 包含无效字符，应该只能包含 0-9、a-z、 A-Z或“_ ”。.

source: '{0}' contains invalid filename characters
zh_cn: '{0}' 包括无效的文件名字符

source: '{0}' contains resources not supported by GameMaker Studio 2 Trial
zh_cn: '{0}' 包含 GameMaker Studio 2 试用版不支持的资源

source: '{0}' contains resources not supported by the Trial version of GameMaker Studio 2.
zh_cn: '{0}' 包含的资源不被GameMaker Studio 2的试用版支持。

source: '{0}' is not a valid GameMaker Studio 2 project
zh_cn: '{0}' 不是有效的 GameMaker Studio 2 项目

source: (${input_count} inputs)
zh_cn: (${input_count} 个输入)

source: (1,2,4,8,16 and so on).
zh_cn: (1、2、4、8、16 等)。

source: (67108864 by the way!), well we can use the syntax above to easily set flags like this:
zh_cn: （顺便一提，是 67108864！），而我们可以通过上述用法很容易地将标记设置成这样：

source: (Disabled)
zh_cn: (禁用)

source: (This is the equivalent of dividing by 32, then multiplying by 32, thereby removing the lower bits.)
zh_cn: （这相当于除以 32，然后乘以 32，从而去掉较低的位。）

source: (keyboard) 1
zh_cn: (大键盘) 1

source: (keyboard) 2
zh_cn: (大键盘) 2

source: (you can use an existing GameMaker:Studio marketplace certificate)
zh_cn: (你可以使用已有的 GameMaker:Studio 市场证书)

source: + "S" : This will force GameMaker Studio 2 to save your project.
zh_cn: + "S"：它会要求GameMaker Studio 2保存你的工程。

source: + "T" : This will open the Goto Window which enables you to quickly search for and go to any resource in your game.
zh_cn: + "T"：它会打开前往（Goto）窗口来允许你快速地搜索并前往游戏中的任意资源。

source: + "Y" : This will redo a previous action that was undone and works in most of the editors.
zh_cn: + "Y"：它可以在绝大多数编辑器中重做（Redo）之前被撤销的变动。

source: + "Z" : This will undo the previous action and works in most of the editors.
zh_cn: + "Z" ：它可以在绝大多数编辑器中撤销（Undo）之前的动作。

source: + : This will open the Workspace Overview window which can be used to navigate quickly between items that are open in the different workspaces.
zh_cn: + ：它能打开工作区概览（Workspace Overview）窗口，其可以用于在不同工作区内的项之间快速导航。

source: , the dimension input will be ignored
zh_cn: ，这个维度的输入将会被忽略

source: , too few anchors and/or dimensions are set
zh_cn: ，锚点太少和/或者维度已经设置

source: , try setting the dimension instead
zh_cn: ，尝试设置维度代替

source: - Must be between 5 and 30 characters long
zh_cn: - 必须在5-30字符之间

source: --- > application surface created and render target set
zh_cn: --- > 应用表面层创建及渲染目标设置

source: --- > the application surface is now drawn to the back buffer by default (although you can switch this off)
zh_cn: --- > 应用表面层现在绘制到默认的背面缓存区（虽然你可以关掉这个过程）。

source: --- > the application surface target is reset here
zh_cn: --- > 应用表面层在此重置

source: ---- any key code
zh_cn: ---- 任意一个键码

source: ...why not check out our all new {0}'Getting Started'{1} video
zh_cn: ...为什么不查看我们全新的{0}'入门'{1}视频

source: .yydebug File
zh_cn: .yydebug 文件

source: // Your code here
zh_cn: // 在这里撰写你的代码

source: /// @description Insert description here\n// You can write your code in this editor
zh_cn: /// @description 在此处插入描述 \n// 你可以在此编辑器中写入代码

source: /// @description This is the AI Fight alarm
zh_cn: /// @description这是AI战斗警报

source: /// @description Your text here
zh_cn: /// @description你的文字在这里

source: //Create the array for (var i = 9; i > -1; i--;)
zh_cn: for (var i = 9; i > -1; i--;) // 创建数组

source: //Delete the array a = 0;
zh_cn: a = 0; //删除数组

source: / + "S" : This will force GameMaker Studio 2 to save your project.
zh_cn: / + "S" : 这将使 GameMaker Studio 2 保存你的项目。

source: / + "T" : This will open the Goto Window which enables you to quickly search for and go to any resource in your game.
zh_cn: / + "T" : 这将打开 Goto 窗口 ，使得你能够快速搜索并访问你的游戏中的任何资源。

source: / + "Y" : This will redo a previous action that was undone and works in most of the editors.
zh_cn: / + "Y" : 这将在绝大多数编辑器中重做之前的动作。

source: / + "Z" : This will undo the previous action and works in most of the editors.
zh_cn: / + "Z"：这将在绝大多数编辑器中撤销之前的动作。

source: / + "Z"：它将在绝大多数编辑器中重做之前的动作。你也可以进行多重撤销，所以你可以多按几次来“回滚”改动。
zh_cn: / + "Z"：这将在绝大多数编辑器中撤销之前的动作。你可以进行多重撤销，所以你可以多按几次来“回滚”改动。

source: / + : This will open the Workspace Overview window which can be used to navigate quickly between items that are open in the different workspaces.
zh_cn: / + : 这将打开 工作区概述 窗口，该窗口用于在不同工作区中打开的项之间快速导航。

source: 0 = block, 1 = don't block
zh_cn: 0 = 阻止, 1 = 不阻止

source: 0 seconds
zh_cn: 0 秒

source: 1 Dimension Arrays
zh_cn: 一维数组

source: 1 second
zh_cn: 1 秒

source: 1-byte Integer
zh_cn: 单字节整数

source: 10 digit alpha-numeric identifier taken from your developer.apple.com/#/overview URL
zh_cn: 取自您的 developer.apple.com/#/overview 网址的10位字母数字标识符

source: 10 digit alpha-numeric identifier taken from your developer.apple.com/#/overview URL.
zh_cn: 取自您的developer.apple.com/#/overview 网址的10位字母数字标识符。

source: 10 seconds
zh_cn: 10 秒

source: 114x114 Icon
zh_cn: 114x114 图标

source: 120x120 Icon
zh_cn: 120x120 图标

source: 1280x768 Icon
zh_cn: 1280x768 图标

source: 144x144 Icon
zh_cn: 144x144 图标

source: 152x152 Icon
zh_cn: 152x152 图标

source: 16 bit
zh_cn: 16位

source: 167x167 Icon
zh_cn: 167x167 图标

source: 16bit
zh_cn: 16位

source: 1D array
zh_cn: 一维数组（1D）

source: 2 Dimension Arrays
zh_cn: 二维数组

source: 2 columns
zh_cn: 2 列

source: 2 seconds
zh_cn: 2 秒

source: 2-byte Integer
zh_cn: 双字节整数

source: 24bit
zh_cn: 24位

source: 2D arrays
zh_cn: 二维数组（2D）

source: 3 columns
zh_cn: 3 列

source: 3 seconds
zh_cn: 3 秒

source: 32-bit Floating Point
zh_cn: 32位浮点数

source: 3rd Party Frameworks + Bundles
zh_cn: 第三方框架 + 捆绑包

source: 3rd Party Support
zh_cn: 第三方支持

source: 4 seconds
zh_cn: 4 秒

source: 4-byte Integer
zh_cn: 四字节整数

source: 400x240 Icon
zh_cn: 400x240 图标

source: 400x240 Icon 2x
zh_cn: 400x240 图标 2x

source: 480x800 Splash Screen
zh_cn: 480x800 启用画面

source: 4GB or more RAM
zh_cn: 4GB或更多RAM

source: 4x4 Matrix
zh_cn: 4x4 矩阵

source: 5 seconds
zh_cn: 5 秒

source: 57x57 Icon
zh_cn: 57x57 图标

source: 6 seconds
zh_cn: 6 秒

source: 64-bit Floating Point
zh_cn: 64位浮点数

source: 64bit Intel compatible Dual Core CPU
zh_cn: 64bit Intel 可兼容双核 CPU

source: 64bit Intel compatible Quad core CPU
zh_cn: 64bit Intel 可兼容四核 CPU

source: 7 seconds
zh_cn: 7 秒

source: 720x1280 Splash Screen
zh_cn: 720x1280 启动画面

source: 72x72 Icon
zh_cn: 72x72 图标

source: 768x1280 Splash Screen
zh_cn: 768x1280 启动画面

source: 76x76 Icon
zh_cn: 76x76 图标

source: 8 bit
zh_cn: 8位

source: 8 seconds
zh_cn: 8 秒

source: 9 seconds
zh_cn: 9 秒

source: : This can be used to collapse or expand all the different docked windows in the IDE.
zh_cn: ：它能够折叠或展开IDE中所有层叠窗口。

source: : This will open the manual.
zh_cn: ：它能打开本帮助手册

source: <No path>
zh_cn: <没有路径>

source: <System Device>
zh_cn: <系统设备>

source: Introduction
zh_cn: 前言

source: Additional_Information
zh_cn: 附加信息

source: Editors
zh_cn: 编辑器

source: Tools
zh_cn: 工具

source: Settings
zh_cn: 设置

source: Scripting
zh_cn: 脚本

source: Getting_Started
zh_cn: 入门

source: Quick_Start
zh_cn: 快速入门

source: "My Projects" Location: The location qhere GameMaker Studio 2 will initially create new projects.
zh_cn: “我的工程”文件夹位置（"My Projects" Location）GameMaker Studio 2创建新工程的初始位置。

source: "My Projects" Location: The location where GameMaker Studio 2 will initially create new projects.
zh_cn: “我的项目”目录: GameMaker Studio 2 创建新项目时的默认目录。

source: "description": The description of the last uploaded file.
zh_cn: "description": 上传的最后一个文件的描述。

source: "errorString": returns an Error String for any error.
zh_cn: "errorString": 返回的错误消息。

source: "id": The id which was returned from the called function.
zh_cn: "id": 返回被调用的函数的id，

source: "resultString": This holds a string which is the data blob returned from the cloud.
zh_cn: "resultString": 从云端返回的二进制数据。

source: "status": This holds the status code, where a negative value denotes an error, a description of which will be contained in the “errorString”.
zh_cn: "status": 这是状态码，其中负值表示错误，错误详情包含在“errorstring”中。

source: % when application is not in focus: The base power consumption when GameMaker Studio 2 is not in focus (regardless of the power supply).
zh_cn: % 在应用程序失去焦点时（% when application is not in focus）：当GameMaker Studio 2失去焦点时的基本功耗（该情况下无视电源类型）。

source: % when on AC power: The base power consumption when connected to a power input.
zh_cn: % 在使用交流电源时（% when on AC power）：当连接输入电源时的基本功耗。

source: % when on battery power: The base power consumption when using battery to power the machine.
zh_cn: % 在使用电池电源时（% when on battery power）：当使用机器电池时的基本功耗。

source: &&, ||, ^^ (and, or and xor) - Combine Boolean values to give either true or false.
zh_cn: &&, ||, ^^（与、或和异或） - 将两个布尔值结合在一起判断是真还是否。

source: ++, -- - Add or subtract one from a value.
zh_cn: ++, -- - 递加或递减一。

source: ++a will increment the variable and return the incremented value.
zh_cn: ++a 递增变量并返回增加后的值。

source: +, -, *, / - Add, subtract, multiply and divide.
zh_cn: +, -, *, / - 加，减，乘和除。

source: <, <=, ==, !=, >, >= - These are comparisons and can only give a true or false result (where true can also be interpreted as 1, and false as 0).
zh_cn: <, <=, ==, !=, >, >= - 这些都是比较运算，且只会得出 true 或者 false 的结果（true = 1，false = 0）。

source: -debugoutput <filename>: Sends console output to the filename, excluding any custom debug messages, but including extra information from the runner for bug reporting.
zh_cn: -debugoutput <filename>: 将控制台输出发送到文件名（filename），不包括任何自定义调试信息，但包括来自运行程序错误报告的额外信息。

source: -game <filename>: loads the given game file
zh_cn: -game <filename>: 加载指定的游戏文件

source: -inawindow: Forces the game to start in a window, even when set to run in fullscreen mode.
zh_cn: -inawindow: 强制游戏以窗口方式运行，即使在编译时设置成以全屏模式运行。

source: -intel: This will switch on a fix for bad Intel drivers, no matter what GPU is being used.
zh_cn: -intel: 无论使用什么显卡，这都会启用无效 Inter 驱动修复程序。

source: -noaudio: This switches off all audio in your game.
zh_cn: -noaudio: 关闭游戏中所有的音频。

source: -output <filename>: Sends console output to the filename, including any debug messages that you have in your code base.
zh_cn: -output <filename>: 将控制台输出发送到文件名（filename），包括代码库中的任何调试信息。

source: -software: Will force the game to use Software Vertex Processing instead of hardware for rendering the game graphics.
zh_cn: -software: 强制游戏使用软件顶点处理而不是硬件渲染游戏图形。

source: -vanillaGFX: Using this switches off any check for driver manufacturer, and can be very useful for testing your game "as is".
zh_cn: -vanillaGFX: 使用该选项可以关闭驱动程序制造商检测，这对于测试你的游戏“原貌”非常有用。

source: = - Used to assign a value to a variable.
zh_cn: = - 用来给一个变量赋值。

source: AC power framerate (%): The base IDE framerate modifier when connected to a power input.
zh_cn: 使用交流电源时帧率（%）: 当使用交流电供电时，IDE的帧率。

source: About - Opens the "about GameMaker Studio 2" window where you can get version information on the product (essential for reporting any bugs or issues).
zh_cn: 关于 - 打开 “关于 GameMaker Studio 2” 窗口，你可以在这里面获取到产品的版本信息（在上报 Bug 和问题时这很有用）。

source: Add Event - Add a new event from the event list.
zh_cn: 添加事件 - 从事件列表中添加新事件。

source: Add Existing From My Library - Add resources to the tree from an asset in your Marketplace library.
zh_cn: 从我的库添加现有资源 - 从 Marketplace 库向资源树添加资源。

source: Add Existing - Add an existing resource from a different GameMaker Studio 2 project folder.
zh_cn: 添加现有资源 - 从不同的 GameMaker Studio 2 项目文件夹中添加现有资源。

source: Add Group - Add a new Resource Group folder to the tree at the clicked position.
zh_cn: 添加组 - 在点击的位置向资源树添加新的资源组文件夹。

source: Add default help content: By default this option is enabled and all it does is add a simple comment into the code editor for all new events to remind you that you can add your code there.
zh_cn: 添加默认的事件内容: 该选项默认启用，它所做的只是为所有新事件在 代码编辑器 中添加一个简单的注释，以提醒你可以在那里添加代码。

source: Add default layers when creating a new room - When you create any new room resource, GameMaker Studio 2 will generate a couple of "base" layers for you - a background layer and an instance layer.
zh_cn: 创建新房间时添加默认的层（Add default layers when creating a new room） - 当你创建任意一个房间资源，GameMaker Studio 2将为你生成两个“基础”的层， - 一个背景层和一个实例层。

source: Add default room layers - When you create any new room resource, GameMaker Studio 2 will generate a couple of "base" layers for you - a background layer and an instance layer.
zh_cn: 添加默认房间层 - 当您创建新的场景资源时， GameMaker Studio 2 将为您生成一些“基础”图层 - 背景层和实例层。

source: Allow Empty Tabs To Close Via Shortcut: You can close any open Tabs using the keyboard shortcut + W, but if you disable this option that shortcut will no longer work.
zh_cn: 允许通过快捷键关闭空标签（Allow Empty Tabs To Close Via Shortcut）：你可以使用键盘快捷键 + W关闭任意被打开的标签，但如果禁用该选项，则该快捷键将不再生效。

source: Allow empty tabs to close via shortcut: You can close any open Tabs using the keyboard shortcut / + W, but if you disable this option that shortcut will no longer work.
zh_cn: 允许通过键盘快捷键关闭空的选项卡: 你可以使用键盘快捷键 / + W 关闭任何已经打开的选项卡，但是如果你禁用该选项快捷键将不再有效。

source: Allow workspace chains to overlap: When enabled this option will permit workspace chains to cross and overlap.
zh_cn: 允许工作区的连接线交叉（Allow workspace chains to overlap）：启用该选项后将允许工作区内的连接线彼此交叉重叠。

source: Always Open New Resources Dropped Into IDE: Certain resources (like sprites or sounds) can be dragged onto the main Workspace in the GameMaker Studio 2 IDE and will be detected and added as a new resource in the Resource Tree.
zh_cn: 总是打开被拖拽到IDE中的新资源（Always Open New Resources Dropped Into IDE）：某些资源（像精灵（Sprites）或声音（Sounds））是可以被拖拽到GameMaker Studio 2主工作区中的，并且它能够被检测到并被添加到资源树中作为一个新资源。

source: Anchor Point Height - Set the height of the anchor points, in pixels.
zh_cn: 锚点高度（Anchor Point Height） - 设置锚点高度，以像素为单位。

source: Anchor Point Width - Set the width of the anchor points, in pixels.
zh_cn: 锚点的宽度（Anchor Point Width） - 设置锚点的宽度，以像素为单位。

source: Anchor point colour - Set the colour for the different anchor points on the spline/arc.
zh_cn: 锚点颜色 - 为锚点设置颜色。

source: Anchor point height - Set the height of the anchor points, in pixels.
zh_cn: 锚点高度 - 设置锚点的高度，以像素为单位。

source: Anchor point width - Set the width of the anchor points, in pixels.
zh_cn: 锚点宽度 - 设置锚点的宽度，以像素为单位。

source: Anchor points colour - The colour to be used to draw the path anchor points.
zh_cn: 锚点颜色 - 设置用于绘制路径锚点的颜色。

source: Android - For Android devices, a single *.apk file will be generated which can be used directly on any Android devices or uploaded to the Google Play or Amazon stores (or any other site that accepts Android apps).
zh_cn: Android - 对于Android设备，将生成 *.apk 文件，可直接在 Android 设备上使用，或上传到 Google Play 以及 Amazon 商店（或任何其他接受 Android 应用程序的网站）。

source: Anti-Aliasing Mode: Here you can set the anti-aliasing mode for the output windows font rendering.
zh_cn: 抗锯齿模式（Anti-Aliasing Mode）：在此处你可以设置输出窗口字体渲染的抗锯齿模式。

source: Anti-Aliasing: Here you can set the anti-aliasing mode for the output windows font rendering.
zh_cn: 抗锯齿: 这里可以设置输出窗口字体渲染是否抗锯齿。

source: Asset Cache: The location for saving the asset cache for each project.
zh_cn: 资源缓存（Asset Cache）：该位置用于存储每个工程的资源缓存。

source: Asset cache directory: The location for saving the asset cache for each project.
zh_cn: 资产缓存目录: The location for saving the asset cache for each project.

source: Audio Groups - View the Audio Group window.
zh_cn: 音频组 - 查看 音频组 窗口

source: Auto Delete Temp Folder: Checking this will force GameMaker Studio 2 to automatically delete the Temp folder that it creates per project for compiling etc...
zh_cn: 自动删除临时文件夹（Auto Delete Temp Folder）：勾选此项将会强制GameMaker Studio 2自动删除每次编译工程等时候产生的临时文件夹。

source: Auto add function brackets: Enable or disable the automatic addition of brackets () when you use the autocomplete.
zh_cn: 自动添加函数括号: 启用或禁用在使用自动填充时自动为函数添加括号 ()。

source: Auto indent after brace: Enable or disable auto-indentation for your code when adding braces {}.
zh_cn: 在大括号后自动缩进: 启用或者禁用代码添加 {} 时的自动缩进。

source: Automatic Response to Exit Confirmation: This option permits you to set whether a confirmation message should be shown when you exit GameMaker Studio 2.
zh_cn: 自动响应退出确认: 此选项允许你设置当T你退出 GameMaker Studio 2 时是否弹出提示。

source: Automatic response to DnD&trad; conversion to Gamemaker Language: You can use the right mouse button within the Drag and Drop workspace to select the option to turn all Drag and Drop for that event into GML code.
zh_cn: 自动响应 DnD&trad; 转换为 GML: 你可以在拖拽工作区中使用鼠标右键 选择将事件的所有拖拽转换为 GML 代码。

source: Automatic response to DnD™ conversion to GameMaker Language: When you convert a Drag and Drop event or script into GML code, you will by default get a message warning you about what you are about to do and asking if you want to continue.
zh_cn: 自动响应 DnD™ 转换为 GameMaker Language: 当你将拖拽事件或脚本转换为GML代码时，默认情况下会收到一条警告消息询问是否继续。

source: Automatic response to DnD™ conversion to GameMaker Language: When you select the option to convert a DnD™ node to GML, you will be prompted to confirm the change as this cannot be undone.
zh_cn: 自动响应 DnD™ 转化为 GameMaker Language: 选择将 DnD™ 节点转换为 GML 时，系统将提示您是否确认更改，因为该动作无法撤消。

source: Automatic response to DnD™ conversion to GameMaker Language: When you use the right mouse button menu option on a timeline moment to convert Drag and Drop actions into script (code) you will get a prompt asking you if you wish to continue, since this is a one way conversion.
zh_cn: 自动响应 DnD™ 转换为 GameMaker Language: 当您在时间轴上使用鼠标右键 菜单选项将拖放模块转换为脚本（代码）时，您会收到一个提示，询问您是否要继续，因为这是一个单向转换。

source: Automatic response to DnD™ node deletion: When you delete a Drag and Drop event node, you will by default get a message warning you about what you are about to do and asking if you want to continue.
zh_cn: 自动响应 DnD™ 节点删除: 当你删除拖拽事件节点时，默认收到警告消息询问是否继续。

source: Automatic response to closing a workspace via keyboard shortcut: The keyboard shortcut mentioned above can be used to close any open tab, but sometimes you may accidentally close an empty tab that you require.
zh_cn: 通过键盘快捷键自动响应关闭工作区: 上述快捷键可以关闭任何打开的选项卡，但是有时候你可能会意外地关闭你需要的空选项卡。

source: Automatic response to closing the debugger: This option permits you to set the automatic response when closing the debugger.
zh_cn: 自动响应关闭调试器: 此选项允许你在关闭调试器时设置自动响应。

source: Automatic response to committing changes on tool change - When you change draw tools after editing a frame, by default a message shows to ask if you want to commit the changes made.
zh_cn: 自动响应工具更改时提交更改 - 当你在编辑帧后更改绘图工具时，默认会显示一条消息，询问你是否要提交所做的更改。

source: Automatic response to deleting custom views: When you have created a custom Resource Tree view and then choose to delete it, you will be shown a message asking if you wish to continue and remove the view.
zh_cn: 自动响应删除自定义视野: 创建自定义资源树视图后，当您删除它时，系统将显示一条消息，询问是否继续并删除该视图。

source: Automatic response to deleting frames - When you delete a frame by default a message shows to ask if you are sure you want to do this.
zh_cn: 自动响应删除帧 - 当你删除帧时，默认显示一条消息询问你是否确定要这样做。

source: Automatic response to exceeding physics vertex limit: This option can be used to control the pop up message that is shown when you exceed the permitted vertex number in the physics shape editor.
zh_cn: 自动响应超出物理顶点限制: 当物理形状编辑器中超过允许的顶点数目时会显示一条警告信息。

source: Automatic response to file deletion: The default setting here is to show a message asking if you are sure you want to delete, but you can set this to "OK" so that all deletions are completed without this message as if you'd clicked okay already.
zh_cn: 自动响应文件删除: 默认设置是显示一条信息，询问你是否确定删除，但是你可以将其设置为“确定”，以便所有删除造作在没有此消息的情况下完成，就像你已经点击了“确定”一样。

source: Automatic response to file import: When you import a new image and one already exists, by default you will be prompted to continue importing and overwrite the existing image or cancel the operation.
zh_cn: 自动响应文件导入: 当你导入一张已经到如果的图片时，默认你会被提示是否要继续导入以覆盖原图或取消当前操作。

source: Automatic response to group selected warning - If you select multiple layers in the layer editor and then try to draw or edit then you will be shown a message by default to inform you that it is not possible.
zh_cn: 自动响应组选择的警告 - 如果在层编辑器中选择多个层，然后尝试绘制或编辑，那么默认情况下将显示一条消息，告诉你这是不可能的。

source: Automatic response to image load failure: When you import a new image and and the import fails, by default you will be shown a warning message informing you that there has been a failure.
zh_cn: 自动响应图片加载失败: 当你导入新的图片但导入失败时，你默认会收到一个对话框提示告知导入失败。

source: Automatic response to invalid layer selection drag error - Here you can choose what happens when you drag a resource onto the room editor when you have selected multiple layers in the layer editor (or have not selected any layer at all).
zh_cn: 自动响应无效层选区拖动错误 - 当您在图层编辑器中选择多个图层（或根本没有选择任何图层），将资源拖动到场景编辑器时。

source: Automatic response to invalid resource drag error - If you try to add a resource to a layer that is not designated as being for that resource type (like adding a sprite to a path layer), then you will be shown a message by default to inform you that it can't be done.
zh_cn: 自动响应无效资源拖动错误 - 如果您尝试向未指定为该资源类型的层添加资源（例如向路径层添加精灵），则默认情况下将显示一条消息通知你无法完成此操作。

source: Automatic response to item locked warning - If you try to delete an item it happens to be locked, you will be shown a message by default.
zh_cn: 自动响应项目锁定警告 - 如果您尝试删除一个项目，它恰巧被锁定，默认情况下会显示一条消息。

source: Automatic response to item owner layer locked warning - If you try to delete an item on a layer and the layer happens to be locked (even if the item is not), then you will be shown a message by default to inform you that it can't be done.
zh_cn: 自动响应项目所有者图层的锁定警告 - 如果您尝试删除图层上的项目，并且图层恰好被锁定（即使该项目未被锁定），则默认情况下将显示一条消息以通知您无法完成此操作。

source: Automatic response to layer locked warning - If you try to delete a layer in the room and it happens to be locked, you will be shown a message by default.
zh_cn: 自动响应层锁定警告 - 如果您尝试删除场景中的图层，并且该图层恰好被锁定，默认情况下将显示一条消息。

source: Automatic response to locked layer warning - If you try to edit a locked layer you'll get a message by default informing you that you can't do this.
zh_cn: 自动响应锁定层警告 - 如果你试图编辑一个锁定的陈，默认会显示一条警告信息告诉你不能这样做。

source: Automatic response to locked or invisible layer drag error - Here you can choose what happens when you drag a resource onto a layer that has been locked or is flagged as invisible.
zh_cn: 自动响应锁定/隐藏层拖动错误 - 当您选择将资源拖动到已锁定或被标记为不可见的图层时。

source: Automatic response to opening multiple resources: As mentioned above in the general Resource Tree preferences, when you open multiple resources at once from the resource tree, you can get a warning if the number exceeds the number specified.
zh_cn: 自动响应打开多个资源: 如上所述，在“资源树”首选项中，当从资源树中一次打开多个资源时，如果打开数目超过指定的数字，则会收到警告。

source: Automatic response to parent room item deletion - Here you can choose what happens when you delete an item that is part of a parent room (and so present in all child rooms).
zh_cn: 自动响应父房间项目删除 - 当您选择删除作为母场景一部分（并且在所有子场景中存在）的项目时。

source: Automatic response to parent room layer deletion - Here you can choose what happens when you delete a layer that is part of a parent room (and so present in all child rooms).
zh_cn: 自动响应父房间层删除 - 当您选择删除作为母场景一部分（并且在所有子场景中存在）的图层时。
